# Задача 6: Вы пользуетесь общественным транспортом? Вероятно, вы
# расплачивались за проезд и получали билет с номером. Счастливым
# билетом называют такой билет с шестизначным номером, где сумма
# первых трех цифр равна сумме последних трех. Т.е. билет с номером
# 385916 – счастливый, т.к. 3+8+5=9+1+6. Вам требуется написать
# программу, которая проверяет счастливость билета.


s = str(input("Введите номер билета: "))
if len(str(s)) == 6:   #Проверяем, что введенное значение является шестизначным числом
    sum1=int(s[0])+int(s[1])+int(s[2]) # Считаем суммы цифр в каждой половине
    sum2=int(s[3])+int(s[4])+int(s[5])
    if sum1==sum2:  # Проверяем, является ли билет счастливым
        print('Yes - это счастливый билет')
    else: 
        print('No - это обычный билет')
else:
     print("Это не номер билета")


