# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе
# они сделали S журавликов. Сколько журавликов сделал каждый
# ребенок, если известно, что Петя и Сережа сделали одинаковое
# количество журавликов, а Катя сделала в два раза больше журавликов,
# чем Петя и Сережа вместе?

s = int(input("Введите количество журавликов: ")) #Просим ввести количество
# print((s//6), ((s//6)*4), (s//6)) #можно решить попроще, но таким образом будет просто 3 числа
print("Петя сделал -", (s//6)) #такой способ вывода показался более интерактивным
print("Катя сделала -", ((s//6)*4))
print("Сережа сделал -", (s//6))